In [1]:
from pyspark.sql import SparkSession

spark=SparkSession.builder.appName("Basics Transformation").master("local[*]").getOrCreate()
spark

Setting default log level to "WARN".
To adjust logging level use sc.setLogLevel(newLevel). For SparkR, use setLogLevel(newLevel).

25/04/13 13:54:50 WARN NativeCodeLoader: Unable to load native-hadoop library for your platform... using builtin-java classes where applicable

In [37]:
emp_data_1 = [
    ["001","101","John Doe","30","Male","50000","2015-01-01"],
    ["002","101","Jane Smith","25","Female","45000","2016-02-15"],
    ["003","102","Bob Brown","35","Male","55000","2014-05-01"],
    ["004","102","Alice Lee","28","Female","48000","2017-09-30"],
    ["005","103","Jack Chan","40","Male","60000","2013-04-01"],
    ["006","103","Jill Wong","32","Female","52000","2018-07-01"],
    ["007","101","James Johnson","42","Male","70000","2012-03-15"],
    ["008","102","Kate Kim","29","Female","51000","2019-10-01"],
    ["009","103","Tom Tan","33","","58000","2016-06-01"],
    ["010","104","Lisa Lee","27","Female","47000","2018-08-01"]
]

In [38]:
employee_schema="employee_id string,department_id string,name string,age string,gender string,salary string,hire_date string"

In [39]:
emp=spark.createDataFrame(data=emp_data_1,schema=employee_schema)
emp.show()

+-----------+-------------+-------------+---+------+------+----------+
|employee_id|department_id|         name|age|gender|salary| hire_date|
+-----------+-------------+-------------+---+------+------+----------+
|        001|          101|     John Doe| 30|  Male| 50000|2015-01-01|
|        002|          101|   Jane Smith| 25|Female| 45000|2016-02-15|
|        003|          102|    Bob Brown| 35|  Male| 55000|2014-05-01|
|        004|          102|    Alice Lee| 28|Female| 48000|2017-09-30|
|        005|          103|    Jack Chan| 40|  Male| 60000|2013-04-01|
|        006|          103|    Jill Wong| 32|Female| 52000|2018-07-01|
|        007|          101|James Johnson| 42|  Male| 70000|2012-03-15|
|        008|          102|     Kate Kim| 29|Female| 51000|2019-10-01|
|        009|          103|      Tom Tan| 33|      | 58000|2016-06-01|
|        010|          104|     Lisa Lee| 27|Female| 47000|2018-08-01|
+-----------+-------------+-------------+---+------+------+----------+

In [7]:
#casting the column using col
#casting salary into double
from pyspark.sql.functions import col,cast

emp_casted=emp.select("employee_id","name","age",col("salary").cast("double"))
emp_casted.printSchema()

root
 |-- employee_id: string (nullable = true)
 |-- name: string (nullable = true)
 |-- age: string (nullable = true)
 |-- salary: double (nullable = true)

In [8]:
#create a new column with title tax 20% of the salary
# to create a new column or derived column we have to use withColumn

emp_taxed=emp_casted.withColumn("tax",col("salary")*0.2)
emp_taxed.show()

+-----------+-------------+---+-------+-------+
|employee_id|         name|age| salary|    tax|
+-----------+-------------+---+-------+-------+
|        001|     John Doe| 30|50000.0|10000.0|
|        002|   Jane Smith| 25|45000.0| 9000.0|
|        003|    Bob Brown| 35|55000.0|11000.0|
|        004|    Alice Lee| 28|48000.0| 9600.0|
|        005|    Jack Chan| 40|60000.0|12000.0|
|        006|    Jill Wong| 32|52000.0|10400.0|
|        007|James Johnson| 42|70000.0|14000.0|
|        008|     Kate Kim| 29|51000.0|10200.0|
|        009|      Tom Tan| 33|58000.0|11600.0|
|        010|     Lisa Lee| 27|47000.0| 9400.0|
+-----------+-------------+---+-------+-------+

In [9]:
#i want to create some dummy values- use lit()

from pyspark.sql.functions import lit
emp_taxed_new_columns=emp_taxed.withColumn("dummy1",lit(7)).withColumn("dummy2",lit("Nine"))
emp_taxed_new_columns.show()

+-----------+-------------+---+-------+-------+------+------+
|employee_id|         name|age| salary|    tax|dummy1|dummy2|
+-----------+-------------+---+-------+-------+------+------+
|        001|     John Doe| 30|50000.0|10000.0|     7|  Nine|
|        002|   Jane Smith| 25|45000.0| 9000.0|     7|  Nine|
|        003|    Bob Brown| 35|55000.0|11000.0|     7|  Nine|
|        004|    Alice Lee| 28|48000.0| 9600.0|     7|  Nine|
|        005|    Jack Chan| 40|60000.0|12000.0|     7|  Nine|
|        006|    Jill Wong| 32|52000.0|10400.0|     7|  Nine|
|        007|James Johnson| 42|70000.0|14000.0|     7|  Nine|
|        008|     Kate Kim| 29|51000.0|10200.0|     7|  Nine|
|        009|      Tom Tan| 33|58000.0|11600.0|     7|  Nine|
|        010|     Lisa Lee| 27|47000.0| 9400.0|     7|  Nine|
+-----------+-------------+---+-------+-------+------+------+

In [10]:
# Renaming a column
#select employee_id as emp_id, salary,age,tax 

emp_renamed=emp_taxed_new_columns.withColumnRenamed("employee_id","emp_id")
emp_renamed.show()

+------+-------------+---+-------+-------+------+------+
|emp_id|         name|age| salary|    tax|dummy1|dummy2|
+------+-------------+---+-------+-------+------+------+
|   001|     John Doe| 30|50000.0|10000.0|     7|  Nine|
|   002|   Jane Smith| 25|45000.0| 9000.0|     7|  Nine|
|   003|    Bob Brown| 35|55000.0|11000.0|     7|  Nine|
|   004|    Alice Lee| 28|48000.0| 9600.0|     7|  Nine|
|   005|    Jack Chan| 40|60000.0|12000.0|     7|  Nine|
|   006|    Jill Wong| 32|52000.0|10400.0|     7|  Nine|
|   007|James Johnson| 42|70000.0|14000.0|     7|  Nine|
|   008|     Kate Kim| 29|51000.0|10200.0|     7|  Nine|
|   009|      Tom Tan| 33|58000.0|11600.0|     7|  Nine|
|   010|     Lisa Lee| 27|47000.0| 9400.0|     7|  Nine|
+------+-------------+---+-------+-------+------+------+

In [13]:
dropped_emp_rename=emp_renamed.drop("dummy1","dummy2").show
dropped_emp_rename.show()

+------+-------------+---+-------+-------+
|emp_id|         name|age| salary|    tax|
+------+-------------+---+-------+-------+
|   001|     John Doe| 30|50000.0|10000.0|
|   002|   Jane Smith| 25|45000.0| 9000.0|
|   003|    Bob Brown| 35|55000.0|11000.0|
|   004|    Alice Lee| 28|48000.0| 9600.0|
|   005|    Jack Chan| 40|60000.0|12000.0|
|   006|    Jill Wong| 32|52000.0|10400.0|
|   007|James Johnson| 42|70000.0|14000.0|
|   008|     Kate Kim| 29|51000.0|10200.0|
|   009|      Tom Tan| 33|58000.0|11600.0|
|   010|     Lisa Lee| 27|47000.0| 9400.0|
+------+-------------+---+-------+-------+

In [15]:
#i want to print the employees who are paying more than 10000 as a their tax amount

above_ten_thousand_tax=dropped_emp_rename.filter("tax>10000")

In [18]:
#i want to print 1st 5 highest tax payers from employees table
top_5_taxpayers=above_ten_thousand_tax.orderBy(col("tax").desc()).limit(5)
top_5_taxpayers.show()

[Stage 26:=======>                                                  (1 + 7) / 8]

+------+-------------+---+-------+-------+
|emp_id|         name|age| salary|    tax|
+------+-------------+---+-------+-------+
|   007|James Johnson| 42|70000.0|14000.0|
|   005|    Jack Chan| 40|60000.0|12000.0|
|   009|      Tom Tan| 33|58000.0|11600.0|
|   003|    Bob Brown| 35|55000.0|11000.0|
|   006|    Jill Wong| 32|52000.0|10400.0|
+------+-------------+---+-------+-------+

In [19]:
# what i want to create tax, dummy1 and dummy2 columns in one go

#adding multiple columns 

columns={"tax": col("salary")*0.2,
         "dummy1":lit(7),
         "dummy2":lit("Nine")
        }

In [20]:
emp_multi_column=emp_casted.withColumns(columns)
emp_multi_column.show()

+-----------+-------------+---+-------+-------+------+------+
|employee_id|         name|age| salary|    tax|dummy1|dummy2|
+-----------+-------------+---+-------+-------+------+------+
|        001|     John Doe| 30|50000.0|10000.0|     7|  Nine|
|        002|   Jane Smith| 25|45000.0| 9000.0|     7|  Nine|
|        003|    Bob Brown| 35|55000.0|11000.0|     7|  Nine|
|        004|    Alice Lee| 28|48000.0| 9600.0|     7|  Nine|
|        005|    Jack Chan| 40|60000.0|12000.0|     7|  Nine|
|        006|    Jill Wong| 32|52000.0|10400.0|     7|  Nine|
|        007|James Johnson| 42|70000.0|14000.0|     7|  Nine|
|        008|     Kate Kim| 29|51000.0|10200.0|     7|  Nine|
|        009|      Tom Tan| 33|58000.0|11600.0|     7|  Nine|
|        010|     Lisa Lee| 27|47000.0| 9400.0|     7|  Nine|
+-----------+-------------+---+-------+-------+------+------+

In [21]:
emp.show()

+-----------+-------------+-------------+---+------+------+----------+
|employee_id|department_id|         name|age|gender|salary| hire_date|
+-----------+-------------+-------------+---+------+------+----------+
|        001|          101|     John Doe| 30|  Male| 50000|2015-01-01|
|        002|          101|   Jane Smith| 25|Female| 45000|2016-02-15|
|        003|          102|    Bob Brown| 35|  Male| 55000|2014-05-01|
|        004|          102|    Alice Lee| 28|Female| 48000|2017-09-30|
|        005|          103|    Jack Chan| 40|  Male| 60000|2013-04-01|
|        006|          103|    Jill Wong| 32|Female| 52000|2018-07-01|
|        007|          101|James Johnson| 42|  Male| 70000|2012-03-15|
|        008|          102|     Kate Kim| 29|Female| 51000|2019-10-01|
|        009|          103|      Tom Tan| 33|  Male| 58000|2016-06-01|
|        010|          104|     Lisa Lee| 27|Female| 47000|2018-08-01|
+-----------+-------------+-------------+---+------+------+----------+

In [43]:
# change Male to M and Female to F name the columns as new_gender

# we have to use 'when'(like case in sql)

from pyspark.sql.functions import when,expr

emp_gender=emp.withColumn("new_gender",when(col("gender")=="Male","M").when(col("gender")=="Female","F").otherwise(None)).drop("gender")
emp_gender.show()


emp_gender_sql=emp.withColumn("new_gender",expr("case when gender='Male' then 'M' when gender='Female' then 'F' else null end")).drop("gender")
emp_gender_sql.show()

+-----------+-------------+-------------+---+------+----------+----------+
|employee_id|department_id|         name|age|salary| hire_date|new_gender|
+-----------+-------------+-------------+---+------+----------+----------+
|        001|          101|     John Doe| 30| 50000|2015-01-01|         M|
|        002|          101|   Jane Smith| 25| 45000|2016-02-15|         F|
|        003|          102|    Bob Brown| 35| 55000|2014-05-01|         M|
|        004|          102|    Alice Lee| 28| 48000|2017-09-30|         F|
|        005|          103|    Jack Chan| 40| 60000|2013-04-01|         M|
|        006|          103|    Jill Wong| 32| 52000|2018-07-01|         F|
|        007|          101|James Johnson| 42| 70000|2012-03-15|         M|
|        008|          102|     Kate Kim| 29| 51000|2019-10-01|         F|
|        009|          103|      Tom Tan| 33| 58000|2016-06-01|      null|
|        010|          104|     Lisa Lee| 27| 47000|2018-08-01|         F|
+-----------+-------------+-------------+---+------+----------+----------+

+-----------+-------------+-------------+---+------+----------+----------+
|employee_id|department_id|         name|age|salary| hire_date|new_gender|
+-----------+-------------+-------------+---+------+----------+----------+
|        001|          101|     John Doe| 30| 50000|2015-01-01|         M|
|        002|          101|   Jane Smith| 25| 45000|2016-02-15|         F|
|        003|          102|    Bob Brown| 35| 55000|2014-05-01|         M|
|        004|          102|    Alice Lee| 28| 48000|2017-09-30|         F|
|        005|          103|    Jack Chan| 40| 60000|2013-04-01|         M|
|        006|          103|    Jill Wong| 32| 52000|2018-07-01|         F|
|        007|          101|James Johnson| 42| 70000|2012-03-15|         M|
|        008|          102|     Kate Kim| 29| 51000|2019-10-01|         F|
|        009|          103|      Tom Tan| 33| 58000|2016-06-01|      null|
|        010|          104|     Lisa Lee| 27| 47000|2018-08-01|         F|
+-----------+-------------+-------------+---+------+----------+----------+

In [46]:
# convert a date
# select *, to_date(hire_date,"yyyy-mm-dd") as hire_date

from pyspark.sql.functions import to_date

emp_date_converted=emp_gender_sql.withColumn("hire_date",to_date(col("hire_date"),'yyyy-MM-dd'))
emp_date_converted.show()
emp_date_converted.printSchema()

+-----------+-------------+-------------+---+------+----------+----------+
|employee_id|department_id|         name|age|salary| hire_date|new_gender|
+-----------+-------------+-------------+---+------+----------+----------+
|        001|          101|     John Doe| 30| 50000|2015-01-01|         M|
|        002|          101|   Jane Smith| 25| 45000|2016-02-15|         F|
|        003|          102|    Bob Brown| 35| 55000|2014-05-01|         M|
|        004|          102|    Alice Lee| 28| 48000|2017-09-30|         F|
|        005|          103|    Jack Chan| 40| 60000|2013-04-01|         M|
|        006|          103|    Jill Wong| 32| 52000|2018-07-01|         F|
|        007|          101|James Johnson| 42| 70000|2012-03-15|         M|
|        008|          102|     Kate Kim| 29| 51000|2019-10-01|         F|
|        009|          103|      Tom Tan| 33| 58000|2016-06-01|      null|
|        010|          104|     Lisa Lee| 27| 47000|2018-08-01|         F|
+-----------+-------------+-------------+---+------+----------+----------+

root
 |-- employee_id: string (nullable = true)
 |-- department_id: string (nullable = true)
 |-- name: string (nullable = true)
 |-- age: string (nullable = true)
 |-- salary: string (nullable = true)
 |-- hire_date: date (nullable = true)
 |-- new_gender: string (nullable = true)

In [47]:
# i want to create a dataframe with current date and timestamp
from pyspark.sql.functions import current_date,current_timestamp
emp_dated=emp_date_converted.withColumn("date_now",current_date()).withColumn("timestamp",current_timestamp())
emp_dated.show(truncate=False)

+-----------+-------------+-------------+---+------+----------+----------+----------+--------------------------+
|employee_id|department_id|name         |age|salary|hire_date |new_gender|date_now  |timestamp                 |
+-----------+-------------+-------------+---+------+----------+----------+----------+--------------------------+
|001        |101          |John Doe     |30 |50000 |2015-01-01|M         |2025-04-13|2025-04-13 15:03:16.762802|
|002        |101          |Jane Smith   |25 |45000 |2016-02-15|F         |2025-04-13|2025-04-13 15:03:16.762802|
|003        |102          |Bob Brown    |35 |55000 |2014-05-01|M         |2025-04-13|2025-04-13 15:03:16.762802|
|004        |102          |Alice Lee    |28 |48000 |2017-09-30|F         |2025-04-13|2025-04-13 15:03:16.762802|
|005        |103          |Jack Chan    |40 |60000 |2013-04-01|M         |2025-04-13|2025-04-13 15:03:16.762802|
|006        |103          |Jill Wong    |32 |52000 |2018-07-01|F         |2025-04-13|2025-04-13 15:03:16.762802|
|007        |101          |James Johnson|42 |70000 |2012-03-15|M         |2025-04-13|2025-04-13 15:03:16.762802|
|008        |102          |Kate Kim     |29 |51000 |2019-10-01|F         |2025-04-13|2025-04-13 15:03:16.762802|
|009        |103          |Tom Tan      |33 |58000 |2016-06-01|null      |2025-04-13|2025-04-13 15:03:16.762802|
|010        |104          |Lisa Lee     |27 |47000 |2018-08-01|F         |2025-04-13|2025-04-13 15:03:16.762802|
+-----------+-------------+-------------+---+------+----------+----------+----------+--------------------------+

In [49]:
#dropping the null records
emp_2=emp_dated.dropna()
emp_2.show()

+-----------+-------------+-------------+---+------+----------+----------+----------+--------------------+
|employee_id|department_id|         name|age|salary| hire_date|new_gender|  date_now|           timestamp|
+-----------+-------------+-------------+---+------+----------+----------+----------+--------------------+
|        001|          101|     John Doe| 30| 50000|2015-01-01|         M|2025-04-13|2025-04-13 15:04:...|
|        002|          101|   Jane Smith| 25| 45000|2016-02-15|         F|2025-04-13|2025-04-13 15:04:...|
|        003|          102|    Bob Brown| 35| 55000|2014-05-01|         M|2025-04-13|2025-04-13 15:04:...|
|        004|          102|    Alice Lee| 28| 48000|2017-09-30|         F|2025-04-13|2025-04-13 15:04:...|
|        005|          103|    Jack Chan| 40| 60000|2013-04-01|         M|2025-04-13|2025-04-13 15:04:...|
|        006|          103|    Jill Wong| 32| 52000|2018-07-01|         F|2025-04-13|2025-04-13 15:04:...|
|        007|          101|James Johnson| 42| 70000|2012-03-15|         M|2025-04-13|2025-04-13 15:04:...|
|        008|          102|     Kate Kim| 29| 51000|2019-10-01|         F|2025-04-13|2025-04-13 15:04:...|
|        010|          104|     Lisa Lee| 27| 47000|2018-08-01|         F|2025-04-13|2025-04-13 15:04:...|
+-----------+-------------+-------------+---+------+----------+----------+----------+--------------------+

In [54]:
#how to handle null values
#select *, nvl("new_gender",0) as new_gender from employees

from pyspark.sql.functions import coalesce,lit
emp_fill_null=emp_dated.withColumn("gender",coalesce(col("new_gender"),lit(0))).drop("new_gender")
emp_fill_null.printSchema()
emp_fill_null.rdd.getNumPartitions()

root
 |-- employee_id: string (nullable = true)
 |-- department_id: string (nullable = true)
 |-- name: string (nullable = true)
 |-- age: string (nullable = true)
 |-- salary: string (nullable = true)
 |-- hire_date: date (nullable = true)
 |-- date_now: date (nullable = false)
 |-- timestamp: timestamp (nullable = false)
 |-- gender: string (nullable = false)

8

In [53]:
#writing the final result as csv file
emp_fill_null.write.format("csv").save("data/output/13/emp.csv")

In [57]:
emp.select(emp.department_id).distinct().show()

[Stage 128:==============>                                          (2 + 6) / 8]

+-------------+
|department_id|
+-------------+
|          101|
|          102|
|          103|
|          104|
+-------------+

In [58]:
emp.distinct().show()

[Stage 131:>                                                        (0 + 8) / 8]

+-----------+-------------+-------------+---+------+------+----------+
|employee_id|department_id|         name|age|gender|salary| hire_date|
+-----------+-------------+-------------+---+------+------+----------+
|        001|          101|     John Doe| 30|  Male| 50000|2015-01-01|
|        002|          101|   Jane Smith| 25|Female| 45000|2016-02-15|
|        003|          102|    Bob Brown| 35|  Male| 55000|2014-05-01|
|        005|          103|    Jack Chan| 40|  Male| 60000|2013-04-01|
|        004|          102|    Alice Lee| 28|Female| 48000|2017-09-30|
|        006|          103|    Jill Wong| 32|Female| 52000|2018-07-01|
|        007|          101|James Johnson| 42|  Male| 70000|2012-03-15|
|        008|          102|     Kate Kim| 29|Female| 51000|2019-10-01|
|        010|          104|     Lisa Lee| 27|Female| 47000|2018-08-01|
|        009|          103|      Tom Tan| 33|      | 58000|2016-06-01|
+-----------+-------------+-------------+---+------+------+----------+